[SETUP]
PLATFORM=x64
SETUP_CODE={28B89EEF-3001-0000-0002-CF3F3A09B77D}
TITLE=\Autodesk® AutoCAD® 2020
LOG=%tmp%\Autodesk AutoCAD 2020 Setup.log
EVALMSI=SetupRes\eval.msi
PRIMARY_MSI=%platform%\%setupuilang%\acad\AcadPS\AcadPS.msi
SYSUPDATE=MSI
RESOURCE_PATH=%lang%\SetupRes
INSTALL_PATH=%ProgramFiles%\Autodesk
CREATE_DESKTOP_SHORTCUT=YES
II_ENABLED=YES
LPMODE=NO_UI
UPI2_GENERATE=YES
UPI2_PRODUCTLINE=ACD
UPI2_RELEASE=2020
UPI1_MASTER_ID=NA
UPI2_UNITTYPE=PRD
DEFAULTMEDIALANGUAGE=fr-FR
AVAILABLELANGUAGES=fr-FR

#============================= Help Link =============================
DOCUMENT_LINK=https://www.autodesk.com/autocad-win-installation-help-2020-%setupuilang%
DOCUMENT_FALLBACK_LINK=Docs\acad_install_help\index.html
SYSTEMREQUIRE_LINK=https://www.autodesk.com/autocad-win-sys-reqs-2020-%setupuilang%
SYSTEMREQUIRE_FALLBACK_LINK=Docs\acad_sysreq\index.html
SUPPORT_LINK=https://www.autodesk.com/autocad-win-readme-2020-%setupuilang%
SUPPORT_FALLBACK_LINK=Readme\readme.html

#============================= Platform Requirement =============================
OSMAJVER=5
OSMINVER=1
SPMAJVER=2

#============================= UI =============================
TOP_BANNER=SetupRes\TopBanner.png
LOADING_IMAGE=SetupRes\AutoCAD.png
BACKGROUND_IMAGE=SetupRes\AutoCAD.png
LOGO=SetupRes\Adsk_white.png
UI_MODE=

#============================= Deployment Info =============================
DEPLOYMENT_NAME=
CLIENT_LOGGING=YES
EXTRA_FILES=acad;*.exe:Setup:CER:eula:3rdParty\msi:nlsdl:3rdParty\dotNetFramework:setupres:%lang%
PRODLINE=ACD

#============================= Install Execute & UI Sequence =============================
EXE_SEQUENCE=ACAD_MAIN;ACAD;ACAD_LP;ACAOE;ACADPV;NLM;CADM;ACADAPPMGR;ACADFEATUREDAPPS;PERFORMANCETOOL;ADSKAPP;AGS
INSTALL_SEQUENCE=NLM;CADM;ACAD_MAIN;ACAD;ACAD_LP;ACAOE;ACADPV;ACADAPPMGR;ACADFEATUREDAPPS;PERFORMANCETOOL;ADSKAPP;AGS
UI_SEQUENCE=LaunchDlg;BeginDeploymentDlg;LicenseDlg;ProductInfoDlg;ProductSelectionDlg2;ACAD_MAIN;ACAD;ACAD_LP;ACAOE;ACADPV;CADM;ADSKAPP;ADSKLICENSING;FullProgressDlg;InstallCompleteDlg;DeploymentCompleteDlg;DeploymentFailedDlg

#============================= AdLM ProdKey Info =============================
ADLM_CONFIG_FILE=Setup\AutoCADConfig.pit
ADLM_PIT_DLL=Setup\adlmPIT.dll
ADLM_VERSION=2020.0.0.F

#============================= Custom Callback Function =============================
CB_FUNC=CustomPlatformCheck
CB_SOURCE=Setup\AcSetup.dll
CB_SOURCE_II=Setup\AcSetupII.dll
CB_PARAM=5.2-x64;5.1-x86;10.0-x86;10.0.10240-x64;10.0.10586-x64;https://www.autodesk.com/autocad-win-sys-reqs-2020-
CB_DESCRIPTION=Custom callback function to check platform support.

#============================= Global MSI Properties =============================
UPI2={1DF758C8-3B22-414A-985A-829EE708926B}
UPI2_BUILDNUM=23.1.47.0
PATH_LENGTH=109
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/SETUP_x64.tar.lzma2
DOWNLOAD_UNCOMPSIZE=239812763
DOWNLOAD_COMPSIZE=187431808
RELEASE_GUID={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}
WEB=YES
SETUP_TYPE=13
USE_REMOVABLE_DRIVE=NO
[GLOBAL_MSI_PROPERTIES]

#============================= ACAD =============================

[ACAD]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk® AutoCAD® 2020 Core
SHAREDPROPERTIES_REQUIRED=INSTALLDIR;ACADSERIALPREFIX;ACADSERIALNUMBER;ACADSTANDALONENETWORKTYPE;ADSK_LAUNCH_MODE;LOCKSECURITYSETTINGS;LEGACYCODESEARCH;
EXE_PATH=%platform%\acad\acad.msi
EXE_PARAM=
EXTRA_FILES=acad;acad\*.ico
LOG=%tmp%\Autodesk AutoCAD 2020 Core Install.log
ROLLBACKABLE=YES
HIDDEN=YES
ADMIN_INSTALL=YES
DEPLOYMENTLANGUAGE=
ACTION=INSTALL
REMOVE_PATH=
USE_EXTERNAL_UI=YES
UI_SEQUENCE=PathCustomizationPage_ACAD;OnlineResourcesPage
UPI2_GENERATE=YES
UPI2_PRODUCTLINE=ACD
UPI2_RELEASE=2020
UPI1_MASTER_ID={28B89EEF-3001-0000-0002-CF3F3A09B77D};{28B89EEF-3001-0000-0102-CF3F3A09B77D}
UPI2_UNITTYPE=COM
UPI2_ROOTFEATURE=P
CanSpan=1
AVAILABLELANGUAGES=fr-FR
DOWNLOAD_UNCOMPSIZE=2436477930
DOWNLOAD_COMPSIZE=646089013
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ACAD_x64.tar.lzma2

[ACAD_fr-FR]
DISK_LABEL=acad2020
DISK_PROMPT=\AutoCAD 2020 Disk 1

#============================= ACAD Language Pack =============================

[ACAD_LP]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk® AutoCAD® 2020 Language Core
EXE_PATH=%platform%\%lang%\acad\AcadLP\AcadLP.msi
EXE64_PATH=%platform%\%lang%\acad\AcadLP\AcadLP.msi
LOG=%tmp%\Autodesk AutoCAD 2020 LangPack Install.log
HIDDEN=YES
ADMIN_INSTALL=YES
ACTION=INSTALL
DISK_PROMPT=\AutoCAD 2020 Disk 1
DISK_LABEL=acad2020
UI_SEQUENCE=PathCustomizationPage_ACAD
UPI2_GENERATE=YES
UPI2_PRODUCTLINE=ACD
UPI2_RELEASE=2020
UPI1_MASTER_ID={28B89EEF-3001-040C-1002-CF3F3A09B77D};{28B89EEF-3001-040C-1102-CF3F3A09B77D}
UPI2_UNITTYPE=LP
UPI2_ROOTFEATURE=P
LPMODE=MLD_ADR
DEFAULTMEDIALANGUAGE=fr-FR
AVAILABLELANGUAGES=fr-FR

#============================= ACAD Product Specific Pack =============================

[ACAD_MAIN]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk® AutoCAD® 2020
SHAREDPROPERTIES_AVAILABLE=INSTALLDIR;ACADSERIALPREFIX;ACADSERIALNUMBER;ACADSTANDALONENETWORKTYPE;ADSK_LAUNCH_MODE;NIWSELECTION;ACADSERVERPATH;ACADSERVERFMTPATH;ACADLICENSETYPE;ACADLICENSESERVERTYPE;ACAD_LICENSESERVER_DISTRIBUTED;ADLM_PRODKEY;ADLM_EULA_COUNTRY;ACADProfile_TrustedPaths;ACADProfile_TrustedDomains;ACAD_USE_ONLINE_CONTENT;LOCKSECURITYSETTINGS;LEGACYCODESEARCH;ACADDisplayStartTab;SECURELOAD
PREREQUISITE=ACAD_VISTA_BLOCK;IE;SSE2;DOTNET47;DOTNET47LANG;VCREDIST2012X86UPD4;VCREDIST2012X64UPD4;VCREDIST2017X86;VCREDIST2017X64;DIRECTX;MSXML6;CM;CMILB;ADSKLICENSING;SAVETOWEBANDMOBILE;ADSSO
POSTREQUISITE=
SHAREDREQUISITE=ACAD;ACAD_LP;ACAOE;ACADPV
EXE_PATH=%platform%\%lang%\acad\AcadPS\AcadPS.msi
LOG=%tmp%\Autodesk AutoCAD 2020 PSPack Install.log
ADMIN_INSTALL=YES
PRODUCT_MESSAGE=AcSetupRes.dll;41
PRODUCT_INSTALLED_INFO_MSG=AcSetupRes.dll;70
PRODUCT_INSTALLED_INFO_URL=AcSetupRes.dll;71
EULA_PATH=eula
ACTION=INSTALL
DISK_PROMPT=\AutoCAD 2020 Disk 1
DISK_LABEL=acad2020
EXTRA_FEATURES=Express_Tools
LAUNCH_EXE=acad.exe
LAUNCH_SHORTCUT=AutoCAD 2020 - Français (French)\AutoCAD 2020 - Français (French).lnk
UI_SEQUENCE=InstallTypePage;ContentLocationPage;ExecutableFileSettingsPage;PathCustomizationPage_ACAD;AddAdditionalFilesPage;WorkstationSettingPage;StartTabSettingsPage;ServicePackPageForDeploy;ServicePackPageForInstall;OnlineResourcesPage
MAINTENANCE_UI_SEQUENCE=OemPreinstallLicenseDlg;OemPreinstallProductInfoDlg;MaintenanceDlg;AddRemoveFeaturesDlg;RepairDlg;MaintVerifyReadyDlg;FullProgressDlg;MaintCompleteDlg;MaintFailedDlg
VC_FUNC=CheckInstallCondition
VC_SOURCE=Setup\AcSetup.dll
VC_SOURCE_II=Setup\AcSetupII.dll
VC_PARAM=2;4;30;http://www.autodesk.com/certified-hardware
VC_DESCRIPTION=Check Hardware Requirements
SUMMARY_FUNC=LoadSummary_ACAD
SUMMARY_SOURCE=SetupAcadUi.dll
SUBCOMPONENT=ACADAPPMGR;ACADFEATUREDAPPS;PERFORMANCETOOL
UPI2_GENERATE=YES
UPI2_PRODUCTLINE=ACD
UPI2_RELEASE=2020
UPI1_MASTER_ID={28B89EEF-3001-040C-2002-CF3F3A09B77D};{28B89EEF-3001-040C-2102-CF3F3A09B77D}
UPI2_UNITTYPE=COM
UPI2_ROOTFEATURE=P
LPMODE=MLD_ADR
DEFAULTMEDIALANGUAGE=fr-FR
AVAILABLELANGUAGES=fr-FR

#============================= ACA OE =============================

[ACAOE]
PLATFORM=NATIVE
PRODUCT_NAME=ACA & MEP 2020 Object Enabler
SHAREDPROPERTIES_REQUIRED=INSTALLDIR
EXE_PATH=%platform%\ACAOE\AcaOE.msi
LOG=%tmp%\Autodesk AutoCAD 2020 OEPack Install.log
HIDDEN=YES
ADMIN_INSTALL=YES
ACTION=INSTALL
DISK_PROMPT=\AutoCAD 2020 Disk 1
DISK_LABEL=acad2020
UI_SEQUENCE=PathCustomizationPage_ACAD
AVAILABLELANGUAGES=fr-FR
DOWNLOAD_UNCOMPSIZE=48054615
DOWNLOAD_COMPSIZE=12134771
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ACAOE_x64.tar.lzma2

[ACAOE_fr-FR]
DISK_LABEL=acad2020
DISK_PROMPT=\AutoCAD 2020 Disk 1

#============================= ACAD Private =============================

[ACADPV]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk AutoCAD 2020
SHAREDPROPERTIES_REQUIRED=INSTALLDIR;ACADSERIALPREFIX;ACADSERIALNUMBER;ACADSTANDALONENETWORKTYPE;ADSK_LAUNCH_MODE;NIWSELECTION;ACADSERVERPATH;ACADSERVERFMTPATH;ACADLICENSETYPE;ACADLICENSESERVERTYPE;ACAD_LICENSESERVER_DISTRIBUTED;ADLM_PRODKEY;ADLM_EULA_COUNTRY;ACADProfile_TrustedPaths;ACADProfile_TrustedDomains;ACAD_USE_ONLINE_CONTENT;ACADDisplayStartTab;LOCKSECURITYSETTINGS;SECURELOAD
EXE_PATH=%platform%\ACADPRIVATE\AcadPrivate.msi
LOG=%tmp%\Autodesk AutoCAD 2020 Private Install.log
HIDDEN=YES
ADMIN_INSTALL=YES
ACTION=INSTALL
DISK_PROMPT=Autodesk AutoCAD 2020 Disk 1
DISK_LABEL=acad2020
UI_SEQUENCE=PathCustomizationPage_ACAD
UPI2_GENERATE=YES
UPI2_PRODUCTLINE=ACD
UPI2_RELEASE=2020
UPI1_MASTER_ID={28B89EEF-3001-0000-3002-CF3F3A09B77D};{28B89EEF-3001-0000-3102-CF3F3A09B77D}
UPI2_UNITTYPE=APP
UPI2_ROOTFEATURE=P

#============================= Block Vista version Check =============================
DOWNLOAD_UNCOMPSIZE=14783947
DOWNLOAD_COMPSIZE=8834537
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ACADPV_x64.tar.lzma2

[ACAD_VISTA_BLOCK]
PRODUCT_NAME=Block Vista version Check
EXE_PATH=NULL
VC_FUNC=CheckForOSBlock
VC_SOURCE=Setup\AcSetup.dll
VC_SOURCE_II=Setup\AcSetupII.dll
VC_PARAM=6.0-x64;6.0-x86;https://www.autodesk.com/autocad-win-sys-reqs-2020-%setupuilang%
VC_DESCRIPTION=Block Vista version Check

#============================= Common Autodesk Components =============================

#============================= Autodesk Genuine Service =============================

[AGS]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk Genuine Service
EXE_PATH=%platform%\AGS\Autodesk Genuine Service.msi
LOG=%tmp%\AGS Install.log
ROLLBACKABLE=NO
HIDDEN=YES
ADMIN_INSTALL=YES
IGNORE_FAILURE=YES
ACTION=INSTALL
DISKCOST=80000000
UI_SEQUENCE=
HIDDEN_COMPONENT=YES
MINORUPGRADE_PREV_VERSION=YES
UI_PROPERTY=ENABLE_ARP_ENTRY

#============================= Autodesk Tools =============================

[NLM]
PLATFORM=NATIVE
PRODUCT_NAME=Network License Manager
EXE_PATH=%platform%\%lang%\Tools\NLM\NLM.msi
EXE_PARAM=ALLUSERS=1
LOG=%tmp%\NLM Install.log
PRODUCT_MESSAGE=AcSetupRes.dll;47
IGNORE_FAILURE=YES
ALLOW_ADD_REMOVE=NO
ACTION=INSTALL
DISKCOST=8000000
INSTALL_TYPE=4
LPMODE=MLD_ADR
DEFAULTMEDIALANGUAGE=fr-FR
AVAILABLELANGUAGES=fr-FR

#============================= Autodesk License Service =============================

[ADSKLICENSING]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk Licensing
PREREQUISITE=VCREDIST2012X86UPD4;VCREDIST2017X86
EXE_PATH=x86\AdskLicensing\AdskLicensing-installer.exe
EXE_PARAM=--mode unattended --unattendedmodeui none
LOG=%tmp%\Autodesk Licensing.log
HIDDEN=YES
PRODUCT_MESSAGE=SetupRes.dll;710
PARALLEL_INSTALL=YES
DISKCOST=80000000
DOWNLOAD_UNCOMPSIZE=57491456;57491456
DOWNLOAD_COMPSIZE=55585894;55585894
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ADSKLICENSING_x86.tar.lzma2;{A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ADSKLICENSING_x86.tar.lzma2

[CADM]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk CAD Manager Tools
PREREQUISITE=SSE2;VCREDIST2012X86UPD4;VCREDIST2012X64UPD4;VCREDIST2017X86;VCREDIST2017X64
EXE_PATH=%platform%\%lang%\Tools\CADManager\CADManager.msi
LOG=%tmp%\CADManager Install.log
PRODUCT_MESSAGE=AcSetupRes.dll;46
IGNORE_FAILURE=YES
ALLOW_ADD_REMOVE=NO
ACTION=INSTALL
INSTALL_TYPE=4
LPMODE=MLD_ADR
DEFAULTMEDIALANGUAGE=fr-FR
AVAILABLELANGUAGES=fr-FR

#============================= Common Autodesk Content =============================

[CM]
PLATFORM=ALL
PRODUCT_NAME=Autodesk Material Library 2020
EXE_PATH=Content\ADSKMaterials\2020\CM\MaterialLibrary2020.msi
EXTRA_FILES=acad;Content\ADSKMaterials\2020\CM\*.cab
LOG=%tmp%\MaterialLibrary2020CM.log
ADMIN_INSTALL=NO
ACTION=INSTALL
DISKCOST=88000000
DOWNLOAD_UNCOMPSIZE=148495780
DOWNLOAD_COMPSIZE=140485123
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/CM.tar.lzma2

[CMILB]
PLATFORM=ALL
PRODUCT_NAME=Autodesk Material Library 2020 - Base Image Library
EXE_PATH=Content\ADSKMaterials\2020\ILB\BaseImageLibrary2020.msi
EXTRA_FILES=acad;Content\ADSKMaterials\2020\ILB\*.cab
LOG=%tmp%\MaterialLibrary2020CMILB.log
ADMIN_INSTALL=NO
ACTION=INSTALL
DISKCOST=81000000

#============================= Autodesk App Manager AppStore bundle for AutoCAD =============================
DOWNLOAD_UNCOMPSIZE=70625081
DOWNLOAD_COMPSIZE=70580853
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/CMILB.tar.lzma2

[ACADAPPMGR]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk App Manager
EXE_PATH=%platform%\ACADExtApps\AutodeskAppManager.msi
EXE_PARAM=ADLANGUAGE=%selectedlang%
LOG=%tmp%\ACADExtApps_AppManager_Install.log
ADMIN_INSTALL=NO
PRODUCT_MESSAGE=AcSetupRes.dll;80
IGNORE_FAILURE=YES
ACTION=INSTALL

#============================= Autodesk Featured Apps AppStore bundle for AutoCAD =============================

[ACADFEATUREDAPPS]
PLATFORM=NATIVE
PRODUCT_NAME=d'applications recommandées d'Autodesk
EXE_PATH=%platform%\ACADExtApps\AutodeskFeaturedApps.msi
EXE_PARAM=ADLANGUAGE=%selectedlang%
LOG=%tmp%\ACADExtApps_FeaturedApps_Install.log
ADMIN_INSTALL=NO
PRODUCT_MESSAGE=AcSetupRes.dll;81
IGNORE_FAILURE=YES
ACTION=INSTALL

#============================= Performance Tool =============================

[PERFORMANCETOOL]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk® AutoCAD® Performance Reporting Tool
EXE_PATH=Tools\PerformanceTool\AcPerfMon.msi
EXE_PARAM=
LOG=%tmp%\Performance_Tool_Install.log
ADMIN_INSTALL=NO
PRODUCT_MESSAGE=AcSetupRes.dll;83
IGNORE_FAILURE=YES
ACTION=

#============================= Autodesk Application Manager =============================

[ADAPPLICATIONMANAGER]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk Application Manager
EXE_PATH=x86\ADAPPLICATIONMANAGER\AdApplicationManager-WebInstaller.exe
EXE_PARAM=
PARALLEL_INSTALL=YES
IGNORE_FAILURE=YES
ACTION=
DISKCOST=80000000
UI_SEQUENCE=AdAppManPage
VC_FUNC=AdAppManCheck
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=5.0.142.5
HIDDEN_COMPONENT=YES

#============================= Application de bureau Autodesk =============================
DOWNLOAD_UNCOMPSIZE=43633722;43633722
DOWNLOAD_COMPSIZE=39250341;39250341
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ADAPPLICATIONMANAGER_x86.tar.lzma2;{A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ADAPPLICATIONMANAGER_x86.tar.lzma2

[ADSKAPP]
PLATFORM=NATIVE
PRODUCT_NAME=Application de bureau Autodesk
EXE_PATH=x86\ADSKAPP\AdApplicationManager-WebInstaller.exe
EXE_PARAM=
PARALLEL_INSTALL=YES
IGNORE_FAILURE=YES
ACTION=INSTALL
DISKCOST=80000000
UI_SEQUENCE=AdAppManPage
HIDDEN_COMPONENT=YES
DOWNLOAD_UNCOMPSIZE=123983024;123983024
DOWNLOAD_COMPSIZE=120666437;120666437
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ADSKAPP_x86.tar.lzma2;{A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ADSKAPP_x86.tar.lzma2

[SAVETOWEBANDMOBILE]
PLATFORM=x64
PRODUCT_NAME=Save to Web and Mobile Feature
EXE_PATH=%platform%\SaveToWebAndMobile\AutodeskSaveToWebAndMobile.msi
LOG=%tmp%\SAVETOWEBANDMOBILE.log
ADMIN_INSTALL=NO
IGNORE_FAILURE=YES
ACTION=INSTALL

#============================= Autodesk Single Sign-On =============================

[ADSSO]
PLATFORM=NATIVE
PRODUCT_NAME=Autodesk Single Sign-On
EXE_PATH=%platform%\AdSSO\AdSSO.msi
IGNORE_FAILURE=YES
ACTION=INSTALL
DISKCOST=80000000
HIDDEN_COMPONENT=YES

#============================= 3rd Party Components =============================

[IE]
PRODUCT_NAME=Internet Explorer
EXE_PATH=NULL
PRODUCT_MESSAGE=SetupRes.dll;209
IGNORE_FAILURE=YES
ACTION=INSTALL
VC_FUNC=IeVerCheck
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=7.0.5730;7.0;1
VC_DESCRIPTION=Detecting Internet Explorer

[MSI]
PLATFORM=ALL
PRODUCT_NAME=Windows Installer Redistributable
EXE_PATH=3rdParty\msi
EXE_PARAM=/quiet /norestart
VC_FUNC=MsiVerCheck
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=4.0
VC_DESCRIPTION=Detecting MSI
DOWNLOAD_UNCOMPSIZE=47945808
DOWNLOAD_COMPSIZE=47512049
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/MSI.tar.lzma2

[NLSDL]
PLATFORM=NATIVE
PRODUCT_NAME=Microsoft NLS Downlevel APIs
EXE_PATH=NLSDL\nlsdl.x86.exe
EXE64_PATH=NLSDL\nlsdl.amd64.exe
EXE_PARAM=/quiet /norestart
IGNORE_FAILURE=YES

[MSXML6]
PLATFORM=NATIVE
PRODUCT_NAME=MSXML 6
EXE_PATH=3rdParty\x86\msxml6\msxml6.msi
EXE64_PATH=3rdParty\x64\msxml6\msxml6_x64.msi
IGNORE_FAILURE=YES
VC_FUNC=MsxmlVerCheck
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=6.0

#============================= Universal C Runtime (KB3118401) =============================

[UCRT]
PLATFORM=NATIVE
PRODUCT_NAME=Universal C Runtime (KB3118401)
EXE_PATH=3rdParty\ucrt\AdUcrtInstaller.exe
EXE_PARAM=/S
ROLLBACKABLE=NO
IGNORE_FAILURE=YES
DISKCOST=80000000

#============================= VC Redistributable 2017 Begin =============================
DOWNLOAD_UNCOMPSIZE=8115025;8115025
DOWNLOAD_COMPSIZE=5747897;5747897
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/UCRT_x86.tar.lzma2;{A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/UCRT_x86.tar.lzma2

[VCREDIST2017X86]
PLATFORM=ALL
PRODUCT_NAME=Microsoft Visual C++ 2017 Redistributable (x86)
PREREQUISITE=UCRT
EXE_PATH=3rdParty\x86\VCRedist\2017\vcredist_x86.exe
EXE_PARAM=/install /quiet /norestart /log %temp%\vcredist_x86_2017.log
IGNORE_FAILURE=YES
VC_FUNC=VCRedistCheckx86
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=14.0;25810
DOWNLOAD_UNCOMPSIZE=14565944
DOWNLOAD_COMPSIZE=12768570
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/VCREDIST2017X86.tar.lzma2

[VCREDIST2017X64]
PLATFORM=x64
PRODUCT_NAME=Microsoft Visual C++ 2017 Redistributable (x64)
PREREQUISITE=UCRT
EXE64_PATH=3rdParty\x64\VCRedist\2017\vcredist_x64.exe
EXE_PARAM=/install /quiet /norestart /log %temp%\vcredist_x64_2017.log
IGNORE_FAILURE=YES
VC_FUNC=VCRedistCheckx64
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=14.0;25810

#============================= VCREDIST Begin =============================
DOWNLOAD_UNCOMPSIZE=15328616
DOWNLOAD_COMPSIZE=13527784
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/VCREDIST2017X64.tar.lzma2

[VCREDIST2012X86UPD4]
PLATFORM=ALL
PRODUCT_NAME=Microsoft Visual C++ 2012 Redistributable (x86) Update 4
EXE_PATH=3rdParty\x86\VCRedist\2012UPD4\vcredist_x86.exe
EXE_PARAM=/install /quiet /norestart /log %temp%\vcredist_x86_2012_UPD4.log
IGNORE_FAILURE=YES
VC_FUNC=VC2012Redistx86check
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=11.0.61030
DOWNLOAD_UNCOMPSIZE=6554576
DOWNLOAD_COMPSIZE=6294127
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/VCREDIST2012X86UPD4.tar.lzma2

[VCREDIST2012X64UPD4]
PLATFORM=x64
PRODUCT_NAME=Microsoft Visual C++ 2012 Redistributable (x64) Update 4
EXE64_PATH=3rdParty\x64\VCRedist\2012UPD4\vcredist_x64.exe
EXE_PARAM=/install /quiet /norestart /log %temp%\vcredist_x64_2012_UPD4.log
IGNORE_FAILURE=YES
VC_FUNC=VC2012Redistx64check
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=11.0.61030

#============================= VCREDIST End =============================
DOWNLOAD_UNCOMPSIZE=7186992
DOWNLOAD_COMPSIZE=6943630
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/VCREDIST2012X64UPD4.tar.lzma2

[SSE2]
PRODUCT_NAME=SSE2 Support Check
EXE_PATH=NULL
PRODUCT_MESSAGE=SSE2 Support Check
VC_FUNC=CheckForSSE2Support
VC_SOURCE=Setup\AcSetup.dll
VC_SOURCE_II=Setup\AcSetupII.dll
VC_DESCRIPTION=SSE2 Support Check

[DOTNET47]
PLATFORM=ALL
PRODUCT_NAME=.NET Framework Runtime 4.7
PREREQUISITE=Win6_1KB4019990_X64;Win7KB4019990_X86;Win2012KB4019990
EXE_PATH=3rdParty\dotNetFramework\47\dotNetFx47_Full_x86_x64.exe
EXE_PARAM=/q /norestart
IGNORE_ERROR=3010
DISKCOST=786432000
VC_FUNC=DotnetVerify
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=.NET Framework 4.7.2053
VC_DESCRIPTION=Detecting .NET 4.7 Runtime
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2

[DOTNET47LANG]
PRODUCT_NAME=.NET Framework Runtime 4.7 Language Pack
EXE_PATH=3rdParty\dotNetFramework\47\dotNetFx47LP_Full_x86_x64_%lcid%.exe
EXE_PARAM=/q /norestart
IGNORE_FAILURE=YES
VC_FUNC=DotnetLangPacksVerCheck
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
VC_PARAM=%lcid%;4.7.2053
VC_DESCRIPTION=Detecting .NET 4.7 Runtime
AVAILABLELANGUAGES=1028;1029;1031;1036;1038;1040;1041;1042;1045;1046;1049;2052;3082
IGNORE_LANGS=1033
LPMODE=MLD_ADR

[Win2012KB4019990]
PLATFORM=x64
PRODUCT_NAME=Microsoft Windows Hotfix KB4019990
EXE_PATH=3rdParty\Hotfix\Windows8-RT-KB4019990-x64.msu
EXE_PARAM=/quiet /norestart
IGNORE_FAILURE=YES
DISKCOST=2880584
VC_FUNC=VerifyKB4019990Win2012
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
DOWNLOAD_UNCOMPSIZE=7178102
DOWNLOAD_COMPSIZE=6114745
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/Win2012KB4019990.tar.lzma2

[Win7KB4019990_X86]
PLATFORM=x86
PRODUCT_NAME=Microsoft Windows Hotfix KB4019990
EXE_PATH=3rdParty\Hotfix\Windows6.1-KB4019990-x86.msu
EXE_PARAM=/quiet /norestart
IGNORE_FAILURE=YES
DISKCOST=1425408
VC_FUNC=VerifyWin7KB4019990X86
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll
DOWNLOAD_UNCOMPSIZE=7178102
DOWNLOAD_COMPSIZE=6114745
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/Win2012KB4019990.tar.lzma2

[Win6_1KB4019990_X64]
PLATFORM=x64
PRODUCT_NAME=Microsoft Windows Hotfix KB4019990
EXE_PATH=3rdParty\Hotfix\Windows6.1-KB4019990-x64.msu
EXE_PARAM=/quiet /norestart
IGNORE_FAILURE=YES
DISKCOST=2873529
VC_FUNC=VerifyWin6_1KB4019990X64
VC_SOURCE=Setup\SetupUi.dll
VC_SOURCE_II=AdAppMgrSetup.dll

#============================= DOTNET Ends =============================
DOWNLOAD_UNCOMPSIZE=7178102
DOWNLOAD_COMPSIZE=6114745
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/Win2012KB4019990.tar.lzma2

[DIRECTX]
PLATFORM=ALL
PRODUCT_NAME=DirectX Runtime
EXE_PATH=3rdParty\DirectX\DXSETUP.exe
EXE_PARAM=/silent
IGNORE_FAILURE=YES
DISKCOST=50000000

#============================= Common Main Pages: Install Mode =============================
DOWNLOAD_UNCOMPSIZE=16868506
DOWNLOAD_COMPSIZE=14745216
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DIRECTX.tar.lzma2

[LaunchDlg]
UI_CREATOR=LaunchDialog
UI_SOURCE=Setup\SetupAcadUi.dll
BACKGROUND_IMAGE=SetupRes\AutoCAD.png

[LicenseDlg]
UI_CREATOR=LicenseDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=NOT ADSK_OEMPREINSTALL

[ProductSelectionDlg2]
UI_CREATOR=ProductSelectionDialog2
UI_SOURCE=Setup\SetupAcadUi.dll
BACKGROUND_IMAGE=SetupRes\AutoCAD.png
UI_POSTCONSTRUCT=SetInstallPathEditorStatus
UI_POSTCONSTRUCT_SOURCE=Setup\AcSetup.dll

[ProductInfoDlg]
UI_CREATOR=ProductInfoDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE<>"TOOLS"

[FullProgressDlg]
UI_CREATOR=FullProgressDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_INFOTAINMENT_PATH=SetupRes\Infotainment\Images
UI_INFOTAINMENT_ELAPSE=18000
BACKGROUND_IMAGE=SetupRes\AutoCAD.png

[InstallCompleteDlg]
UI_CREATOR=InstallCompleteDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE<>"DEPLOYMENT" AND ADSK_LAUNCH_MODE<>"MINIMAL_DEPLOYMENT"
BACKGROUND_IMAGE=SetupRes\AutoCAD.png

#============================= Common Main Pages: Deploy Mode =============================

[BeginDeploymentDlg]
UI_CREATOR=BeginDeploymentDialog
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

#============================= Common Main Pages: Deploy Mode =============================

[DeploymentCompleteDlg]
UI_CREATOR=DeploymentCompleteDialog
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=(ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT") AND ADSK_SETUP_SUCCEEDED
BACKGROUND_IMAGE=SetupRes\AutoCAD.png

[DeploymentFailedDlg]
UI_CREATOR=DeploymentFailedDialog
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=(ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT") AND NOT ADSK_SETUP_SUCCEEDED
BACKGROUND_IMAGE=SetupRes\AutoCAD.png

#============================= Common Config pages: Install Mode =============================

[InstallTypePage]
UI_CREATOR=InstallTypePage
UI_SOURCE=Setup\SetupAcadUi.dll

#============================= Common Config Pages: Deploy Mode =============================

[ContentLocationPage]
UI_CREATOR=ContentLocationPage
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[PathCustomizationPage]
UI_CREATOR=PathCustomizationPage
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[ExecutableFileSettingsPage]
UI_CREATOR=ExecutableFileSettingsPage
UI_SOURCE=Setup\AcDeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[PathCustomizationPage_ACAD]
UI_CREATOR=PathCustomizationPage_ACAD
UI_SOURCE=Setup\AcDeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[AddAdditionalFilesPage]
UI_CREATOR=AddAdditionalFilesPage
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[WorkstationSettingPage]
UI_CREATOR=WorkstationSettingPage
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[StartTabSettingsPage]
UI_CREATOR=StartTabSettingsPage
UI_SOURCE=Setup\AcDeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[ServicePackPageForDeploy]
UI_CREATOR=ServicePackPage
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[ServicePackPageForInstall]
UI_CREATOR=ServicePackPage
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=ADSK_RUNNING_FROM_ADMIN="FALSE" AND NOT ADSK_LAUNCH_MODE="DEPLOYMENT" AND NOT ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[InfoCenterCommCenterPage]
UI_CREATOR=InfoCenterCommCenterPage
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[OnlineResourcesPage]
UI_CREATOR=OnlineResourcesPage
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

[AdAppManPage]
UI_CREATOR=AdAppManPage
UI_SOURCE=Setup\DeployUi.dll
UI_CONDITION=ADSK_LAUNCH_MODE="DEPLOYMENT" OR ADSK_LAUNCH_MODE="MINIMAL_DEPLOYMENT"

#============================= Common Main Pages: Maintenance Mode =============================

[OemPreinstallLicenseDlg]
UI_CREATOR=LicenseDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=ADSK_OEMPREINSTALL="1"

[OemPreinstallProductInfoDlg]
UI_CREATOR=ProductInfoDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=ADSK_OEMPREINSTALL="1"

[MaintenanceDlg]
UI_CREATOR=MaintenanceDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=NOT ADSK_OEMPREINSTALL
BACKGROUND_IMAGE=SetupRes\AutoCAD.png

[AddRemoveFeaturesDlg]
UI_CREATOR=AddRemoveFeaturesDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=NOT ADSK_OEMPREINSTALL AND NOT REINSTALL="ALL" AND NOT REMOVE="ALL"

[RepairDlg]
UI_CREATOR=RepairDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=NOT ADSK_OEMPREINSTALL AND REINSTALL="ALL"

[MaintVerifyReadyDlg]
UI_CREATOR=MaintVerifyReadyDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=NOT ADSK_OEMPREINSTALL

[MaintCompleteDlg]
UI_CREATOR=MaintCompleteDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=NOT ADSK_OEMPREINSTALL AND ADSK_SETUP_SUCCEEDED
BACKGROUND_IMAGE=SetupRes\AutoCAD.png

[MaintFailedDlg]
UI_CREATOR=MaintFailedDialog
UI_SOURCE=Setup\SetupAcadUi.dll
UI_CONDITION=NOT ADSK_OEMPREINSTALL AND NOT ADSK_SETUP_SUCCEEDED
BACKGROUND_IMAGE=SetupRes\AutoCAD.png
[ACAD_LP_fr-FR]
DOWNLOAD_UNCOMPSIZE=147609120
DOWNLOAD_COMPSIZE=21408624
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ACAD_LP_x64_fr-FR.tar.lzma2
[ACAD_MAIN_fr-FR]
DOWNLOAD_UNCOMPSIZE=68289383
DOWNLOAD_COMPSIZE=19469708
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/ACAD_MAIN_x64_fr-FR.tar.lzma2
[CADM_fr-FR]
DOWNLOAD_UNCOMPSIZE=3730145
DOWNLOAD_COMPSIZE=1621465
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/CADM_x64_fr-FR.tar.lzma2
[DOTNET47LANG_1028]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1029]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1031]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1036]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1038]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1040]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1041]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1042]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1045]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1046]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_1049]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_2052]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
[DOTNET47LANG_3082]
DOWNLOAD_UNCOMPSIZE=133802616
DOWNLOAD_COMPSIZE=131051707
URL={A48E816D-4B95-4E9B-BEDE-432E3EF1DC03}/DOTNET47.tar.lzma2
